# St7SetGeometryFaceOffset1

Assigns an offset to the specified geometry face. This value is constant over the surface.

long St7SetGeometryFaceOffset1(long uID, long FaceNum, double* Doubles)

Input Parameters

uID

Strand7 model file ID.

FaceNum

Face number.

Doubles[0]

Offset value.